Revit 2027 API
FamilyInstancePlacingArgs.StatusMessage Property
 The message to be shown on the status bar
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string StatusMessage { get; set; }
Public Property StatusMessage As String
	Get
	Set
public:
property String^ StatusMessage {
	String^ get ();
	void set (String^ value);
}
member StatusMessage : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
FamilyInstancePlacingArgs Class
Autodesk.Revit.UI Namespace